Repository: 84000/data-translation-memory
Catalog: toh557-v3.tmx
Source language: bo
Languages: en

source: དེ་སྐད་ཅེས་ཐོས་མ་ཐག་ཏུ་བཙུན་མོའི་སྙིང་འདར་ཞིང་མིག་དང་གདོང་མཆི་མས་གང་སྟེ་རྒྱལ་པོའི་གན་དུ་སོང་ནས་སྨྲས་པ། ལྷ་བདག་གི་བུ་སྡུག་པ་སྟོར་ཅེས་ཐོས་སོ། །
en: “ ‘The moment the queen heard that, her heartbeat quivered, and her eyes and face streamed with tears. She went to the king and said, “Your Majesty, I have heard that our beloved sons are lost!”

source: རྒྱལ་པོ་ཡང་སྙིང་འདར་ཞིང་ཤིན་ཏུ་མྱོས་ཏེ་ཀྱི་ཧུད་བདག་གི་བུ་སྡུག་པ་དང་བྲལ་བ་ལྟ་ཞེས་སྨྲས་སོ། །
en: “ ‘The king’s heart quivered also, and he was very distressed and cried, “Alas! I have lost my beloved sons!”

source: དེ་ནས་རྒྱལ་པོས་བཙུན་མོ་དབུགས་དབྱུང་བའི་ཕྱིར་ང་གཞོན་ནུ་བཙལ་བ་ལ་ནན་ཏན་དུ་བྱེད་ཀྱིས་བཟང་མོ་མྱ་ངན་མ་བྱེད་ཅིག །
en: “ ‘Then the king, in order to reassure the queen, said, “I will diligently search for the boys, so do not distress yourself, Your Majesty.”

source: དེར་གཞོན་ནུ་ཚོལ་བ་ལ་ཞུགས་པ་ན་སྐྱེ་བོའི་ཚོགས་དག་རོད་རོད་པོར་གྱུར་ཏོ། །
en: “ ‘He then went in search of the boys, with many people busily engaged in it.

source: དེ་ནས་རིང་པོར་མ་ལོན་པར་རྒྱལ་པོས་རྒྱལ་བུ་གཞོན་ནུ་གཉིས་རྒྱང་རིང་པོ་ནས་འོང་བ་མཐོང་ངོ་། །
en: Before long, the king saw the two princes coming in the distance.

source: མཐོང་ནས་ཀྱང་སྨྲས་པ་གཞོན་ནུ་དེ་དག་ནི་འོང་ན་ཐམས་ཅད་ནི་མ་ཡིན་ཏེ།
en: When he saw them, he cried out, “Those are the boys coming, but not all of them are there! Oh! It seems we have lost a son!”

source: ཀྱི་ཧུད་བུ་དང་བྲལ་བ་ལྟ་ཞེས་བྱ་བ་ནི་སྡུག་བསྔལ་བའོ། །ཇི་ལྟར་བུ་དང་བྲལ་བར་གྱུར་ན་ཡིད་ནི་མི་བདེ་བ། །མི་རྣམས་བུ་རྙེད་པ་ནི་དེ་ལྟར་དགའ་བ་མ་ཡིན་ནོ། །
en: In suffering, he said: “ ‘ “The happiness that humans have on obtaining a child Does not equal the unhappiness from losing a child.

source: འཇིག་རྟེན་ནི་གང་དག་བུ་མེད་པ་དང་ཤི་བའམ། །མི་རྣམས་གང་དག་བུ་གསོན་དེ་དག་བདེ་བ་ཡིན་ནམ་ཅི། །
en: Are not those humans in this world happy who die while Their sons are alive, or who have not given birth to children?”

source: དེ་ནས་བཙུན་མོ་ཤིན་ཏུ་མྱ་ངན་གྱིས་ནོན་ནས་རྔ་མོ་གནད་དུ་བསྣུན་པ་བཞིན་དུ་ཤིན་ཏུ་མི་བཟད་པའི་སྒྲ་ཕྱུང་ངོ་། །
en: “ ‘Then the queen, oppressed by misery like a heartbroken she-camel, emitted dreadful cries.

source: དེ་ལྟར་བུ་གསུམ་དག་ནི་གཡོག་གི་ཚོགས་བཅས་ཏེ། །མེ་ཏོག་རྣམས་ཀྱིས་གང་བའི་ནགས་ཁྲོད་ཞུགས་པ་ལས། །བདག་གི་བུ་དགེ་ཐ་ཆུངས་འོངས་པར་མ་གྱུར་ན། །
en: “ ‘ “Thus my three boys, with their servants, Entered the flower-filled forest, But my lovely youngest child has not returned!

source: བདག་གི་སྙིང་དང་འདྲ་བའི་ཐ་ཆུངས་དེ་ག་རེ། །
en: Where is my youngest son, who is like my own heart?”

source: དེ་ནས་དེ་གཉིས་ལྷགས་པ་དང་རྒྱལ་པོས་བུ་ལ་དྲིས་པ།
en: “ ‘Then the two princes arrived, and the king questioned them.

source: ཁྱེའུ་ཐ་ཆུངས་ག་རེ་ཞེས་གཞོན་ནུ་གཉིས་ལ་དྲིས་པ་དང་།
en: He asked the two youths, “Where is your youngest brother?”

source: དེ་ནས་མྱ་ངན་གྱིས་ཉམ་ཐག་ཅིང་མིག་མཆི་མས་གང་སྟེ་རྐན་དང་མཆུ་དང་ཁ་དང་སོ་སྐམས་ནས་ཅང་མི་ཟེར་རོ། །
en: “ ‘They were so devastated by misery, their eyes filled with tears, and their palates, lips, mouths, and teeth having become dry, that they could not say anything.

source: བཙུན་མོས་སྨྲས་པ། ཁོ་མོའི་བུ་སྡུག་ཐ་ཆུངས་དེ་ག་རེ། །
en: “ ‘The queen asked: “ ‘ “Where is my beloved youngest son?

source: ཁོ་མོའི་སྙིང་འདི་གས་ལ་ཐུག་གྱུར་ཅིང་། །ལུས་ནི་མི་བཟད་རབ་ཏུ་གཟིར་གྱུར་ཏེ། །ཁོ་མོའི་དྲན་པ་ཉམས་གྱུར་མྱུར་དུ་སྨྲོས། །
en: This heart of mine is about to break, My body is struck by unendurable pain, And my mind is fainting, so tell me quickly!”

source: དེ་ནས་གཞོན་ནུ་དེ་གཉིས་ཀྱིས་ཇི་ལྟར་གྱུར་པ་དེ་ཞིབ་ཏུ་སྨྲས་སོ། །དེ་ཐོས་མ་ཐག་ཏུ་རྒྱལ་པོ་དང་བཙུན་མོ་མྱོས་པར་གྱུར་ཏེ།
en: “ ‘The two youths then related in detail what had occurred, and as soon as the king and queen heard it, they swooned.

source: མྱོས་པ་སངས་ནས་སྙིང་རྗེ་རྗེ་སྐད་དུ་ངུ་ཞིང་ཕྱོགས་དེར་དོང་ངོ་། །
en: When they recovered from their swoon, they cried piteously and went to that place.

source: དེ་ནས་རྒྱལ་པོ་དང་བཙུན་མོས་རུས་པ་དེ་དག་ཤ་དང་ཁྲག་དང་རྒྱུས་པ་མེད་ཅིང་སྐྲ་ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་འཐོར་བ་མཐོང་ནས་ཤིང་རླུང་གིས་བཏབ་པ་བཞིན་དུ་འགྱེལ་ཏོ། །
en: “ ‘When the king and queen saw those bones with no flesh, blood, or entrails remaining and the hair scattered here and there, they collapsed as if blown over by a wind.

source: དེ་ནས་ཉེ་ཕན་དང་བློན་པོ་དག་གིས་དེ་ལྟར་གྱུར་པ་དེ་མཐོང་ནས་ཆུ་དང་རི་མ་ལ་ཡའི་ཙནྡན་གྱི་འདེ་གུས་རྒྱལ་པོ་དང་བཙུན་མོའི་ལུས་བསིལ་བར་བྱས་སོ། །
en: “ ‘When the principal attendants and ministers saw that, they soothed the king and queen’s bodies with a balm made of water and Malaya Mountain sandalwood.

source: དེ་ནས་རིང་ཞིག་ལོན་པ་དང་འདུ་ཤེས་རྙེད་ནས་རྒྱལ་པོ་ལངས་ཏེ་སྙིང་རྗེ་རྗེ་སྐད་དུ་འབོད་པ། ཀྱེ་མ་བུ་སྡུག་ཡིད་འོང་མཐོང་དགའ་བ། །འཆི་བདག་དབང་དུ་ཅི་ཕྱིར་དེ་མྱུར་སོང་། །
en: “ ‘After a long time had passed, they recovered consciousness, and the king stood and cried out piteously: “ ‘ “Why has my beautiful, handsome, delightful son Fallen so quickly under the power of the lord of death?

source: འཆི་བདག་ཅི་ཕྱིར་ང་ལ་སྔར་མ་འོངས། །
en: Why have I not gone to the lord of death before him?

source: ང་ལ་སྡུག་བསྔལ་འདི་ལས་གཞན་མི་འབྱུང་། །
en: Compared to this, I have never had any suffering.”

source: བཙུན་མོ་ཡང་མྱོས་པ་ལས་སངས་ནས་སྐྲ་གཞིག་ཅིང་ལག་པ་གཉིས་ཀྱིས་བྲང་བརྡུངས་ཏེ། ཉ་ཐང་ལ་ཕྱུང་བ་བཞིན་དུ་སའི་སྟེང་ན་འགྲེ་ལྡོག་ཅིང་མ་ཧེ་བེའུ་སྟོར་བ་དང་རྔ་མོ་རྔེའུ་སྟོར་བ་བཞིན་དུ་སྙིང་རྗེ་རྗེ་སྐད་དུ་དུའོ། །
en: “ ‘The queen also, when she had recovered from her faint, loosened her hair and beat her breast with both hands, writhed on the ground like a fish on dry land, and cried out piteously like a female buffalo or a female camel that has lost her offspring: “ ‘ “Alas!

source: ཀྱེ་མ་སྡུག་ཅིང་གཅེས་པའི་བུ་ནི་པདྨ་འདི། །སུ་ཡིས་ས་ཡི་སྟེང་དུ་བཤིག་ནས་རབ་ཏུ་གཏོར། །
en: Who would rend and scatter on the earth My beloved, beautiful son, who was like a lotus?

source: ཡིད་འོང་མིག་ལྡན་ཟླ་འདྲའི་བཞིན་ཅན་བདག་གི་བུ། །བདག་གི་དགྲ་བོ་གང་གིས་དེ་རིང་ས་འདིར་བཅོམ། །
en: What enemy of mine has, on this day, in this place, destroyed My son who had beautiful eyes and a face like the moon?

source: ཀྱེ་མ་ས་འདིར་བུ་མཆོག་བསད་མཐོང་ན། །ལུས་འདི་ཅི་ཕྱིར་དེ་རིང་ཞིག་མ་གྱུར། །
en: “ ‘ “Alas! Why has my body not been broken on this day By seeing my perfect son slain on this ground?

source: སྡུག་བསྔལ་འདི་འདྲ་མཐོང་ཡང་མ་གས་པས། །བདག་གི་སྙིང་འདི་ལྕགས་ནི་ཡིན་ཡང་དག །
en: This heart of mine must truly be made of iron To have not split apart on witnessing this suffering.

source: དེ་རིང་རྨི་ལམ་དུ་ནི་བདག་གི་ནུ་མ་འགའ་ཞིག་གིས་ནི་རལ་གྲིས་བཅད། །སོ་ཡང་ཕྱུང་བས་དེ་རིང་བདག་གི་བུ་སྡུག་དེ་ནི་མྱུར་དུ་མ་རུང་གྱུར། །
en: “ ‘ “Because in a dream I had today Someone cut off my breasts with a sword And my teeth fell out, I knew something Dreadful had happened to my son.

source: བདག་གིས་ཐི་བའི་ཕྲུག་གུ་གསུམ་ཞིག་རྙེད་པ་གཅིག་འདིར་ཇི་ལྟར་ཁྲས་ཁྱེར་བཞིན། །
en: “ ‘ “I had found three chicks of a dove, And one of them was taken away by a hawk.

source: བདག་གི་བུ་གསུམ་དག་གིས་བསྐོར་བ་ལས་ཀྱང་གཅིག་ནི་དེ་རིང་འཆི་བདག་ཁྱེར། །ཀྱེ་མ་ཧོ་སྡིག་པ་ཅན་གྱི་རྨི་ལམ་དེ་ཡི་འབྲས་བུ་གྲུབ་པ་འདི་ཡིན་ནོ། །
en: In that way, from the three boys who were around me, The lord of death has taken one away today.”

source: དེ་ནས་རྒྱལ་པོ་དང་བཙུན་མོ་སྙིང་རྗེ་རྗེ་སྐད་དུ་རྣམ་པ་མང་པོར་སྨྲེ་ཞིང་རྒྱན་ཐམས་ཅད་བཀྲོལ་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དང་ལྷན་ཅིག་ཏུ་བུའི་རུས་བུ་ལ་མཆོད་པ་བྱས་ནས། གཞོན་ནུའི་རུས་པ་རྣམས་ཕྱོགས་འདིར་བཞག་གོ། །
en: “ ‘Then the king and queen, crying out pitifully many times, cast off their jewelry and together with a great crowd of beings made offerings to the boy’s bones, and then they placed the bones in this spot.

source: ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་སེམས་ཅན་ཆེན་པོ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: “ ‘Ānanda, if you think that at that time, in that time, the prince called Mahāsattva was anyone else, do not have that view.

source: ང་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་གཞོན་ནུ་སེམས་ཅན་ཆེན་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: At that time, I was the prince called Mahāsattva.

source: ཀུན་དགའ་བོ་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་ལས་ཡོངས་སུ་མ་གྲོལ་བ་དེའི་ཚེ་ཡང་། སེམས་ཅན་དམྱལ་བ་ལ་སོགས་པའི་སྡུག་བསྔལ་ལས་ངས་འགྲོ་བ་མཐའ་དག་ལ་ཕན་བཏགས་ན། སྐྱོན་ཐམས་ཅད་དང་བྲལ་ཏེ་ཡང་དག་པར་རྫོགས་པར་སངས་རྒྱས་པ་ད་ལྟར་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “ ‘Ānanda, even at that time, when I was not completely freed from desire, anger, and ignorance, I helped every being, such as those in the hells, be freed from suffering, let alone now when I am a samyak­saṃbuddha who is free of all faults.

source: དེ་ལྟར་སེམས་ཅན་རེ་རེའི་ཕྱིར་ཡང་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་བསྐལ་པར་གནས་པར་སྤྲོ་ཞིང་སྐྱེ་བོ་འཁོར་བ་ལས་རྣམ་པར་བསྒྲལ་ལོ། །
en: “ ‘In that way, for the sake of each being, I would gladly remain in hell for eons and liberate that being from saṃsāra.

source: སེམས་ཅན་གྱི་སྙིང་པོས་ཤིན་ཏུ་བྱ་དཀའ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མས་འགྲོ་བ་མཐའ་དག་ལ་ཕན་བཏགས་སོ། །
en: Those who are dedicated to beings accomplish numerous different kinds of difficult actions so as to benefit all beings.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །བྱང་ཆུབ་མཆོག་འདི་ཡོངས་སུ་ཚོལ་བ་ན། །བསྐལ་པ་མང་པོ་རངས་ནི་ལུས་བཏང་སྟེ། །
en: “The Bhagavat then spoke these verses: “ ‘For many eons, I gave away my body When seeking the highest enlightenment.

source: ཇི་ལྟར་རྒྱལ་པོ་དང་ནི་རྒྱལ་བུར་གྱུར། །དེ་ལྟར་ངས་ནི་ལུས་རྣམས་ཡོངས་སུ་བཏང་། །
en: Whether I was a king or a prince, I gave away my body in that way.

source: སྔོན་གྱི་སྐྱེ་བ་རྣམས་ནི་རྗེས་དྲན་ཏེ། །ཤིང་རྟ་ཆེན་པོ་ཞེས་བྱའི་རྒྱལ་པོ་བྱུང་། །དེ་ལ་བུ་ནི་གཏོང་བ་ཆེ་ལྡན་པ། །སེམས་ཅན་ཆེ་ཞེས་བྱ་བ་དམ་པ་ཡོད། །
en: “ ‘I remember my previous lives: There was a king named Mahāratha Who had a son that made the great gift, A sublime one called Mahāsattva.

source: དེ་ལ་ཕུ་བོ་དག་ནི་གཉིས་ཡོད་དེ། །མིང་ནི་སྒྲ་ཆེན་པོ་དང་ལྷ་ཆེན་པོ། །
en: “ ‘He had two elder brothers Named Mahāpraṇāda and Mahādeva.

source: དཔུང་ཚོགས་དེ་དག་ནགས་ཚལ་སྟུག་པོར་དོང་། །དེ་དག་སྟག་མོ་བཀྲེས་པས་གཟིར་བ་མཐོང་། །
en: The group of siblings went into a thick forest Where they saw a tigress tormented by hunger.

source: དེ་ལ་སེམས་ཅན་མཆོག་དེ་སྙིང་རྗེ་སྐྱེས། །སྟག་མོ་འདི་ནི་བཀྲེས་སྐོམ་གཟིར་བས་ན། །བདག་བུ་དེ་དག་ཟ་བར་འགྱུར་འོང་གིས། །
en: “ ‘Compassion for her arose in that excellent being: “This tigress is so tormented by hunger and thirst She will eventually eat her own children.

source: དེ་ལྟར་བདག་ལུས་ད་ནི་གཏང་བར་བྱ། །
en: Therefore, I will give her my body.”

source: ཤིང་རྟ་ཆེ་བུ་སེམས་ཅན་ཆེ། །སྟག་མོ་བཀྲེས་མཐོང་སྟག་ཕྲུག་རྣམས། །ཐར་བར་བྱ་ཕྱིར་སྙིང་རྗེ་ཡིས། །རི་ངོས་གཟར་ནས་མཆོངས་པ་དང་། །
en: “ ‘Mahāsattva, Mahāratha’s son, Seeing the hungry tigress, with compassion So as to save the tiger cubs Leapt from a mountain cliff.

source: ས་ནི་རི་དང་བཅས་སུ་གཡོས། །བྱ་ཚོགས་རྣམ་མང་རྣམ་པར་འཐོར། །རི་དགས་ཚོགས་སྐྲག་འཇིག་རྟེན་འདི། །མུན་པས་ཐིབས་པོར་གནས་པར་གྱུར། །
en: “ ‘The earth and the mountains shook, The multitudes of birds scattered, The herds of deer were frightened, And this world was enveloped in darkness.

source: དེ་ཡི་ཕུ་བོ་སྒྲ་ཆེན་དང་། །དེ་བཞིན་ལྷ་ཆེན་དེ་གཉིས་ཀྱིས། །ནགས་མཆོག་ཆེན་པོ་དེར་བལྟས་ན། །སེམས་ཅན་ཆེན་པོ་མ་རྙེད་ནས། །
en: “ ‘His older brother Mahāpraṇāda, And likewise Mahādeva, both Looked in that great forest But could not find Mahāsattva.

source: ཤིན་ཏུ་མྱ་ངན་ཟུག་རྔུའི་སྙིང་། །དྲན་མེད་ནགས་ཀྱི་ནང་ན་རྒྱུ། །ནུ་བོ་དེ་ནི་ཡོངས་ཚོལ་ཞིང་། །
en: “ ‘Their hearts pained by intense misery, They roamed within the forest mindlessly, Searching for their younger brother.

source: གདོང་ལ་མཆི་ཟག་ནགས་ཁྲོད་རྒྱུ། །
en: Faces streaming with tears, they wandered the forest.

source: སྒྲ་ཆེན་དེ་བཞིན་ལྷ་ཆེན་པོ། །རྒྱལ་བུ་གཞོན་ནུ་དེ་དག་གཉིས། །སྟག་མོ་ཉམ་ཆུང་གར་ཉལ་བ། །དེར་ནི་ཉེ་བར་སོང་བ་དང་། །
en: “ ‘Those two young princes, Mahāpraṇāda and Mahādeva, Came near the place where The weakened tigress was lying.

source: སྟག་མོ་དང་ནི་སྟག་ཕྲུག་གི །སྟག་གི་མཆུ་ལ་ཁྲག་ཆགས་མཐོང་། །སྐྲ་དང་རུས་པ་ཅུང་ཟད་ཅིག །ས་ལ་རྣམ་པར་འཐོར་བ་མཐོང་། །
en: “ ‘They saw blood on the mouths Of the tigress and the tiger cubs, And some bones and hair were Scattered there upon the ground.

source: དེ་ཡི་ཁྲག་གི་ཐིགས་པ་ནི། །ཉུང་ཞིག་ས་ལ་ཡོད་པར་གྱུར། །
en: “ ‘There were a few drops of blood That had fallen onto the ground.

source: རྒྱལ་པོའི་བུ་ནི་དེ་གཉིས་ཀྱིས། །ཁྲག་ཆགས་པ་ཡི་ས་དེ་མཐོང་། །
en: Those two princes saw that The earth was bloodstained.

source: རབ་ཏུ་བརྒྱལ་ཏེ་ས་དེ་ལ། །འགྱེལ་ནས་ཡིད་ནི་ཉམས་པར་གྱུར། །ལུས་རྣམས་ལ་ནི་རྡུལ་གྱིས་གོས། །དྲན་དབང་ཉམས་ཤིང་སེམས་ཀྱང་མྱོས། །
en: “ ‘They completely fainted away And lay on the ground unconscious, Their bodies covered with dirt, Without awareness, their minds in a swoon.

source: དེ་དག་གི་ནི་འཁོར་རྣམས་ཀྱང་། །སྙིང་རྗེར་ངུ་ཞིང་མྱ་ངན་ནོན། །
en: “ ‘All of their entourage Wept piteously, overcome with misery.

source: དེ་དག་ཆུས་ནི་རབ་འཐོར་ཞིང་། །ལག་པ་སྒྲེང་སྟེ་ངུ་ཞིང་གནས། །
en: They sprinkled water upon them And with arms outstretched, wept.

source: དེ་ནི་འགྱེལ་མ་ཐག་ཏུ་ཡང་། །བཙུན་མོ་གཅེས་མཆོག་སྐྱེད་པའི་མ། །བུད་མེད་དག་ནི་ལྔ་བརྒྱ་དང་། །ཕོ་བྲང་ནང་ན་བདེར་འདུག་པ། །
en: “ ‘The moment that they had fainted, Their mother, the beloved principal queen, Was happily dwelling in the palace With five hundred other women.

source: ནུ་སོར་གཉིས་ཀའི་རྩེ་མོ་ནས། །འོ་མ་ཁྲག་ཏུ་འབྱུང་ཞིང་འཛག །
en: “ ‘From the nipples of both breasts, Her milk came forth as dripping blood.

source: དེ་ཡི་ལུས་དང་ཡན་ལག་ཀུན། །ཁབ་ཀྱིས་གཙགས་པ་བཞིན་དུ་ཚ། །
en: Her entire body and all her limbs Were in pain as if pierced by needles.

source: སྙིང་ནི་རབ་ཏུ་མྱ་ངན་གང་། །བུ་བྲལ་མྱ་ངན་དྲག་མདས་ཕོག །
en: “ ‘Her heart became filled with misery, Hit by the arrow of the grief of losing a child.

source: རྒྱལ་པོའི་གན་དུ་ཉེར་སོང་སྟེ། །མྱ་ངན་རབ་གདུངས་ཡིད་མི་དགའ། །
en: She came before the king, Deeply tormented by misery and in distress.

source: སྙིང་རྗེའི་སྒྲ་ཡིས་རབ་ངུ་ཞིང་། །རྒྱལ་པོ་ཤིང་རྟ་ཆེ་ལ་སྨྲས། །མི་དབང་རྒྱལ་པོ་བདག་ལ་གསོན། །
en: “ ‘With piteous cries she wept And said to King Mahāratha, “King, lord of men, listen to me.

source: བདག་ལུས་མྱ་ངན་མེ་ཡིས་ཚིག །
en: My body is burned by the fire of misery.

source: བདག་གི་ནུ་སོར་རྩེ་གཉིས་ནས། །འོ་མ་ཁྲག་ཏུ་རབ་ཏུ་འབྱུང་། །
en: “ ‘ “From the nipples of both my breasts The milk has emerged as blood.

source: བདག་ལུས་ཁབ་ཀྱིས་གཙགས་བཞིན་ཚ། །བདག་གི་སྙིང་ཡང་གས་ལ་ཐུག །
en: My body is in pain as if pierced by needles, And my heart feels about to break.

source: ཇི་ལྟར་སྡུག་པའི་བུ་རྣམས་ནི། །ཕྱིན་ཅད་མི་མཐོང་འདི་འདྲའི་ལྟས། །
en: “ ‘ “This seems to be a sign that I will Never again see my beloved sons.

source: བདག་གི་བུ་རྣམས་དེ་ལྟར་འཚལ། །ཐུགས་རྗེ་མཛོད་དེ་བདག་སྲོག་སྩོལ། །
en: Therefore, regard me with compassion— Find my sons and give me my life!

source: དེ་རིང་བདག་གི་རྨི་ལམ་ན། །ཐི་བ་ཕྲུག་གུ་གསུམ་རྙེད་ན། །བདག་གི་ཐི་བ་ཕྲུག་གུ་ནི། །
en: “ ‘ “In a dream that I had today, I found three dove chicks.

source: སྡུག་ཅིང་ཡིད་འོང་གང་ལགས་པ། །
en: One of the dove chicks was, To me, the loveliest and prettiest.

source: དེར་ནི་ཁྲ་མཆིས་བདག་གི་ནི། །ཐི་བ་ཕྲུག་གུ་དེ་ཁྲས་འཚལ། །
en: “ ‘ “A hawk came, and that hawk Took my dove chick away.

source: བདག་གི་རྨི་ལམ་དེ་འདྲ་བའི། །མྱ་ངན་སྙིང་འདིར་རབ་ཏུ་ཞུགས། །
en: A grief like that in the dream Has entered here into my heart.

source: སེམས་ནི་མྱ་ངན་རབ་གདུངས་པས། །བདག་ནི་རིང་པོར་མི་ཐོགས་འགུམ། །
en: “ ‘ “My mind is so tormented by sadness It will not be long before I die.

source: བདག་གི་བུ་རྣམས་དེ་ལྟར་འཚལ། །ཐུགས་རྗེ་ལྡན་པ་བདག་སྲོག་སྩོལ། །
en: Therefore, you who are compassionate, Find my sons and give me my life!”

source: དེ་སྐད་སྨྲས་ནས་བཙུན་མོ་མཆོག །བརྒྱལ་ནས་ས་དེར་འགྱེལ་བར་གྱུར། །དྲན་པའི་དབང་པོ་རྣམ་པར་ཉམས། །སེམས་ཀྱང་སྟོར་ཞིང་དྲན་པ་མེད། །
en: “ ‘After she had spoken, the principal queen Fainted and lay there on the floor, The faculty of awareness lost, Her mind scattered and unconscious.

source: བཙུན་མོའི་འཁོར་ཚོགས་ཐམས་ཅད་ཀྱང་། །སྙིང་རྗེའི་སྐད་ཀྱིས་རབ་ཏུ་ངུ་། །བཙུན་མོ་དམ་པ་བརྒྱལ་གྱུར་ཏེ། །ས་ལ་འགྱེལ་བ་མཐོང་ནས་ནི། །
en: “ ‘All of the queen’s retinue also Were weeping with pitiful cries On seeing that the principal queen Had fainted and was lying on the floor.

source: དེ་མ་ཐག་ཏུ་རྒྱལ་དབང་དེ། །བུ་དང་བྲལ་བའི་མྱ་ངན་ནོན། །བློན་པོ་དང་ནི་འཁོར་རྣམས་ཀྱང་། །གཞོན་ནུ་རྣམས་ནི་བཙལ་ཕྱིར་དོང་། །
en: “ ‘Immediately, the lord of kings, Oppressed by the misery of losing his sons, Dispatched his ministers and court To go in search of the youths.

source: གྲོང་ཁྱེར་ཀུན་གྱི་སྐྱེ་བོ་དག །ཐ་དད་ཁྱིམ་ནས་བྱུང་ཞིང་འཁོད། །
en: “ ‘All the people throughout the town Came out of their homes and gathered.

source: ངུ་ཞིང་གདོང་ནས་མཆི་མ་ཟག །ལམ་ཁར་སེམས་ཅན་ཆེ་དེ་འདྲི། །གསོན་ནམ་འོན་ཏེ་ཤི་འམ་ཅི། །
en: Weeping, with tears streaming down their faces, They asked about Mahāsattva on the roads: “ ‘ “Is he alive or is he dead?

source: སེམས་ཅན་ཆེན་པོ་དེ་གར་སོང་། །
en: Where has Mahāsattva gone?

source: བདག་ཅག་དེ་རིང་མཐོང་ཞིག་གམ། །
en: Will we see him today?

source: ཡིད་འོང་སེམས་ཅན་མཐོང་རེ་དགའ། །
en: How joyful to see that delightful being!”

source: དེའུ་རེ་མི་སྙན་ཐོས་འགྱུར་ཞིང་། །ཡུལ་འདིར་མྱ་ངན་མི་བཟད་རླུང་། །སྒྲ་མི་ཕྱིན་ཅིང་སྒྱུ་མཐའ་ཡས། །དྲག་པོའི་སྒྲར་བཅས་ལྡན་ཞིག་གམ། །
en: “ ‘They soon heard an unpleasant sound, A dreadful wind of misery in this land— Endless manifestations that emitted no sound, Together with those with ferocious sounds.

source: རྒྱལ་པོ་ཤིང་རྟ་ཆེ་ལངས་ཏེ། །མྱ་ངན་ནོན་ཅིང་ངུ་བཞིན་དུ། །བཙུན་མོ་དམ་པ་སར་འགྱེལ་ལ། །བདག་ཉིད་ཆུ་ཡི་རྒྱུན་ཀྱང་འཐོར། །
en: “ ‘King Mahāratha, standing up, Oppressed by misery and weeping, Continually sprinkled water on The principal queen lying on the floor.

source: ཇི་སྲིད་དྲན་རྙེད་ལྡན་འགྱུར་བ། །དེ་སྲིད་དུ་ནི་ཆུ་ཡིས་གཏོར། །
en: “ ‘He continued to sprinkle water Until she had regained consciousness.

source: བདག་བུ་གུམ་མམ་གསོན་ཞིག་ཅེས། །ཞུམ་པའི་ཡིད་ཀྱིས་འདྲི་བར་བྱེད། །
en: She asked with a despairing mind, “Are my sons alive or dead?”

source: རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་ཡིས། །བཙུན་མོ་མཆོག་ལ་འདི་སྐད་སྨྲས། །བློན་པོ་དག་དང་འཁོར་རྣམས་ཀྱང་། །གཞོན་ནུ་རྣམས་ནི་ཚོལ་ཕྱིར་དོང་། །
en: “ ‘King Mahāratha said To his principal queen, “The ministers and the court Have gone in search of the boys.

source: ཁྱོད་ནི་རབ་ཏུ་ཡིད་ཞུམ་ཞིང་། །རྟག་ཏུ་མྱ་ངན་སྙིང་མ་བྱེད། །
en: “ ‘ “Do not let your mind be in deep despair And have continuous misery in your heart.”

source: དེ་ལྟར་ཤིང་རྟ་ཆེན་པོ་ཡིས། །བཙུན་མོ་དམ་པ་སྤྲོ་བསྲིངས་ཏེ། །
en: Speaking in that way, Mahāratha Comforted the principal queen.

source: རྒྱལ་པོ་ཕོ་བྲང་ནས་བྱུང་ནས། །མྱ་ངན་ནོན་ཅིང་ངུ་བཞིན་དུ། །བློན་པོའི་ཚོགས་ཀྱིས་ཡོངས་བསྐོར་ཏེ། །ཡིད་ནི་རབ་ཞུམ་ལུས་ཀྱང་ཞན། །
en: “ ‘The king came out of the palace Oppressed by misery and weeping, Accompanied by his ministers, In despair, his body weakened.

source: སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་ཡང་། །ངུ་ཞིང་མཆི་མ་ཟག་བཞིན་རྒྱུག །རྒྱལ་བུ་རྣམས་ནི་བཙལ་བའི་ཕྱིར། །གྲོང་ཁྱེར་གྱི་ནི་མཆོག་ནས་བྱུང་། །
en: “ ‘Also, many hundreds of people, Running, weeping, with tears streaming, Were coming out of the greatest of cities In order to search for the princes.

source: རྒྱལ་པོ་བྱུང་བ་མཐོང་ནས་ནི། །རྒྱལ་པོའི་ཕྱི་བཞིན་ཀུན་ཏུ་འབྲང་། །
en: “ ‘When they saw the king departing, They all followed after the king.

source: རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་ནི། །གྲོང་ཁྱེར་ནས་བྱུང་དེ་མ་ཐག །སྡུག་པའི་བུ་ནི་བལྟ་བའི་ཕྱིར། །རྒོད་པའི་མིག་གིས་ཕྱོགས་སུ་བལྟས། །
en: When King Mahāratha came out Of the city, he immediately “ ‘Looked around with wild eyes Seeking for his beloved sons.

source: མགོ་བྲེགས་ཡན་ལག་ཁྲག་སྦགས་ཤིང་། །ལུས་ལ་རྡུལ་གྱིས་གོས་གྱུར་ལ། །གདོང་ལ་མཆི་ཟག་ངུ་བཞིན་དུ། །འོང་བའི་མི་ཞིག་མཐོང་ནས་ནི། །
en: He saw a man approaching With head shaved and bloody hands, “ ‘His body stained with dirt, weeping, With tears streaming down his face.

source: ཤིང་རྟ་ཆེན་པོའི་སྙིང་ལ་ཡང་། །རབ་ཏུ་མི་བཟད་མྱ་ངན་གནས། །
en: Then there was an unendurable misery Within the heart of Mahāratha.

source: ངུ་ཞིང་གདོང་ལ་མཆི་མ་ཟག །
en: “ ‘He wept, tears running down his face.

source: ལག་པ་བསྒྲེང་སྟེ་ངུ་ཞིང་འདུག །
en: Standing with arms outstretched, he wept.

source: དེ་ནས་བློན་པོ་གཞན་ཞིག་ནི། །རྒྱང་རིང་མྱུར་དུ་རིངས་པར་འོང་། །
en: Then another minister came quickly, Hurriedly, from the far distance.

source: འོངས་ནས་མི་དབང་རྒྱལ་པོ་ནི། །ཤིང་རྟ་ཆེ་ལ་འདི་སྐད་སྨྲས། །མི་དབང་ཐུགས་ངན་མ་མཛད་ཅིག །ཁྱོད་སྲས་ཡིད་དུ་འོང་བ་མཆིས། །
en: “ ‘When he arrived, he said to the king, The lord of men, Mahāratha, “My lord, do not be sad, Your beloved sons are alive.

source: རིང་པོར་མི་ཐོགས་ཁྱོད་ཀྱི་གན་འདིར་ནི། །སྲས་མཆོག་ཡིད་འོང་མཆི་བ་ཁྱོད་ཀྱིས་གཟིགས། །
en: “ ‘ “Before long they will be here with you, And you will see your beloved, excellent sons!”

source: རྒྱལ་པོ་ཡུད་ཙམ་ལམ་དུ་ཞུགས་པ་དང་། །དེ་ནས་བློན་པོ་ཆེན་པོ་གཉིས་པ་འོངས། །
en: The king in a moment set out on the road, And then two prime ministers came.

source: རྡུལ་ཆགས་དྲི་མ་ཅན་གྱི་གོས་གྱོན་ཅིང་། །མཆི་མའི་གདོང་གིས་རྒྱལ་ལ་འདི་སྐད་ཅེས། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱི་སྲས་གཉིས་ནི། །མྱ་ངན་མེ་ཡིས་རབ་ཏུ་གདུངས་ཤིང་གནས། །
en: “ ‘Their clothes were dirty and stained And with tears on their faces they said to the king, “Great King, two of your sons are alive But burning from the fire of misery.

source: རྒྱལ་པོ་ཁྱོད་ཀྱི་སྲས་མཆོག་གཅིག་མི་གདའ། །སེམས་ཅན་ཆེན་པོ་མི་རྟག་ཉིད་ཀྱིས་ཟིན། །
en: “ ‘ “King, one of your excellent sons is missing; Mahāsattva has been seized by impermanence.

source: སྟག་མོ་བུ་བྱུང་རིང་པོར་མ་ལོན་པ། །རང་གི་བུ་རྣམས་ཟ་བར་འདོད་པ་མཐོང་། །
en: He saw a tigress that had recently given birth And she was craving to eat her own cubs.

source: དེ་དག་ལ་ནི་གཞོན་ནུ་སེམས་ཅན་ཆེས། །སྙིང་རྗེ་ཆེན་པོ་ལྡན་པས་སེམས་བསྐྱེད་ནས། །
en: “ ‘ “The youth Mahāsattva had for them A motivation of great compassion.

source: བྱང་ཆུབ་ཏུ་ནི་སྨོན་ལམ་ཆེ་བཏབ་པ། །སེམས་ཅན་ཐམས་ཅད་བདག་གིས་དགྲོལ་བར་བྱ། །
en: He made a great prayer for enlightenment, Saying, ‘I am going to liberate all beings!

source: བྱང་ཆུབ་ཟབ་མོ་རྒྱ་ཆེན་འདོད་པ་ལ། །མ་འོངས་དུས་ན་བདག་གིས་རེག་པར་བྱ། །
en: “ ‘ “ ‘May I in the future reach that vast, Profound enlightenment that I long for!’

source: སེམས་ཅན་ཆེན་པོ་རི་ངོས་གཟར་ནས་མཆོངས། །སྟག་མོ་བཀྲེས་པས་ནོན་པ་དེ་ལངས་ཏེ། །
en: Mahāsattva leapt from a mountain cliff And was taken by the tigress tormented by hunger.

source: ཡུད་ཙམ་གྱིས་ནི་ལུས་ལ་ཤ་མེད་བྱས། །རྒྱལ་པོའི་བུ་ནི་རུས་པ་ཉི་ཚེ་ལུས། །
en: “ ‘ “In a brief time his body had no flesh; Soon only the bones of the prince remained.”

source: མ་རུངས་པ་ཡི་ཚིག་ནི་དེ་ཐོས་ནས། །རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་བརྒྱལ་གྱུར་ཏེ། །
en: King Mahāratha fell into a faint When he heard these dreadful words.

source: ས་ལ་འགྱེལ་ནས་སེམས་ཀྱང་སྟོར་བར་གྱུར། །མྱ་ངན་མེ་ནི་ཤིན་ཏུ་མི་བཟད་འབར། །
en: “ ‘He fell to the ground and lost consciousness, Burned by the unendurable fire of grief.

source: འཁོར་དང་བློན་པོ་སྙིང་རྗེའི་སྐད་ཀྱིས་ནི། །ངུ་ཞིང་མྱ་ངན་ནོན་བཞིན་དེ་དག་ཀྱང་། །ཆུས་འཐོར་ལག་པ་བསྒྲེང་སྟེ་རབ་ཏུ་ངུ་། །
en: His court and the ministers with piteous cries wept, And though oppressed by misery, “ ‘They sprinkled water on him, weeping with upraised arms.

source: བློན་པོ་གསུམ་པས་རྒྱལ་ལ་སྨྲས་པ་ནི། །བདག་གིས་དེ་རིང་གཞོན་ནུ་གཉིས་པོ་དག །ནགས་ཆེན་དེ་ན་རབ་ཏུ་བརྒྱལ་གྱུར་ཅིང་། །ས་ལ་འགྱེལ་ཏེ་སེམས་ཀྱང་སྟོར་མཐོང་ནས། །
en: A third minister said to the king, “Today I saw that the two princes Had fainted in that great forest.

source: དྲན་པ་རྙེད་དེ་ལངས་ཀྱི་བར་དུ་ནི། །བདག་ཅག་རྣམས་ཀྱིས་ཆབ་ཀྱིས་རབ་ཏུ་གཏོར། །
en: “ ‘ “They were lying on the ground, unconscious, And we sprinkled water upon them Until they recovered and stood up.

source: ཕྱོགས་བཞི་དག་ནས་ཀུན་ནས་འབར་བར་མཐོང་། །ཡུད་ཙམ་འགྲེང་ནས་སླར་ཡང་ས་ལ་འགྱེལ། །
en: Ablaze, they looked into the four directions, “ ‘ “And after briefly standing, they again fell to the ground.

source: སྙིང་རྗེའི་སྐད་ཀྱིས་སྨྲེ་སྔགས་རབ་ཏུ་འདོན། །རྟག་པར་ལག་པ་བསྒྲེང་སྟེ་གནས་ནས་ནི། །ནུ་བོ་དེ་ཡི་བསྔགས་པ་རབ་ཏུ་བརྗོད། །
en: With piteous cries they emitted wails, Their arms constantly upraised and in despair, And spoke in praise of their younger brother.”

source: རྒྱལ་པོ་དེ་ནི་རབ་ཏུ་སེམས་ཞུམ་ཞིང་། །བུ་བྲལ་མྱ་ངན་ནོན་ནས་སེམས་ཀྱང་འཁྲུགས། །མྱ་ངན་རབ་ཏུ་གདུངས་ཤིང་སྨྲེ་སྔགས་འདོན། །
en: “ ‘The king was in complete despair; In grief from the loss of his son, his mind was in disarray.

source: རྒྱལ་པོ་དེ་ནི་འདི་སྙམ་ཡོངས་སུ་སེམས། །བདག་བུ་སྡུག་ཅིང་ཡིད་འོང་གཅིག་པོ་ནི། །སེམས་ཅན་ཆེན་པོ་མི་རྟག་ཉིད་ཀྱིས་ཟིན། །བདག་གི་བུ་ནི་གཉིས་པོ་དེ་དག་ཀྱང་། །མྱ་ངན་མེ་ཡིས་སྲོག་ནི་ཟད་འོང་གིས། །
en: Tormented by his grief, he emitted wails, And in his mind the king had this thought: “ ‘ “My one beloved, beautiful son Mahāsattva has been seized by impermanence, And the other two sons of mine Will lose their lives to the fire of grief.

source: འདི་ལྟར་བདག་ནི་མྱུར་དུ་དེར་དོང་ལ། །མཐོང་ན་དགའ་བའི་བུ་དག་བལྟ་བར་བྱས། །
en: “ ‘ “Therefore, I must quickly go there To see my two beloved sons.
